Конфигурация/Reports/ДашбордОбучающегося.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ДашбордОбучающегося</Name>
			<Comment>Персональный дашборд обучающегося: баллы, бейджи, прогресс по темам, рейтинг группы.</Comment>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/Catalogs/МатериалыБиблиотеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МатериалыБиблиотеки</Name>
			<Comment>Учебные материалы (учебники, справочники, методические пособия и т. п.)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМатериаловБиблиотеки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БиблиографическоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевыеСлова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодИздания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Издательство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISBN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКниги</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаКниги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраницыКниги</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПривязкиКТемам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Темы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Reports/ДашбордОбучающегося/Forms/ФормаОтчёта/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Пользователь", Пользователь);
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда

		Пользователь = ОбслуживаниеПользователейВызовСервера.ТекущийПользователь();
	КонецЕсли;

	// Старт теста разрешен только в своем дашборде (см. ПолеHTMLПриНажатии).
	ЭтоМойДашборд = (Пользователь = ОбслуживаниеПользователейВызовСервера.ТекущийПользователь());

	ПараметрПериодОкончание = ТекущаяДатаСеанса();
	ПараметрПериодНачало    = ДобавитьМесяц(ПараметрПериодОкончание, -3);
	
	ТекстHTML = Отчеты.ДашбордОбучающегося.ПолучитьМакетКакСтроку(
		Пользователь, 
		ПараметрПериодНачало, 
		ПараметрПериодОкончание);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработка кликов внутри дашборда. Кликабельные элементы HTML - якорные ссылки
// с атрибутами data-act (действие) и data-id (идентификатор объекта).
&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	Якорь = ДанныеСобытия.Anchor;
	
	Если Якорь = Неопределено Тогда
		
		Возврат;
	КонецЕсли;

	// Это наш управляющий клик - отменяем штатную навигацию поля HTML.
	СтандартнаяОбработка = Ложь;

	Действие = Якорь.getAttribute("data-act");
	ИД       = Якорь.getAttribute("data-id");

	Если Действие = "старт-тест" Тогда

		Если Не ЭтоМойДашборд Тогда
			ПоказатьПредупреждение(,
				"Запустить тест можно только в собственном дашборде."
				+ " Сейчас открыт дашборд другого обучающегося (режим просмотра).");
			Возврат;
		КонецЕсли;

		Если ЗначениеЗаполнено(ИД) Тогда

			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Тема", ТемаПоИД(ИД)));
			ОткрытьФорму("Документ.ПопыткаТеста.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли Действие = "тема" Тогда
		
		Если ЗначениеЗаполнено(ИД) Тогда
			
			ПоказатьЗначение(, ТемаПоИД(ИД));
		КонецЕсли;
	ИначеЕсли Действие = "материал" Тогда
		
		Если ЗначениеЗаполнено(ИД) Тогда
			
			ОткрытьМатериал(ИД);
		КонецЕсли;
	ИначеЕсли Действие = "профиль" Тогда
		
		ПоказатьЗначение(, Пользователь);
	ИначеЕсли Действие = "обновить" Тогда

		ОбновитьНаСервере();
	ИначеЕсли Действие = "библиотека" Тогда

		ОткрытьФорму("Отчет.ДашбордБиблиотеки.Форма.ФормаОтчёта");
	ИначеЕсли Действие = "все-бейджи" Тогда
		
		ПереключитьОверлейБейджей(Элемент, Истина);
	ИначеЕсли Действие = "закрыть-бейджи" Тогда
		
		ПереключитьОверлейБейджей(Элемент, Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьВыполнить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьНаСервере()
	Пользователь = ОбслуживаниеПользователейВызовСервера.ТекущийПользователь();
	// Обновление всегда перечитывает дашборд под текущим пользователем - значит, свой.
	ЭтоМойДашборд = Истина;
	ТекстHTML = Отчеты.ДашбордОбучающегося.ПолучитьМакетКакСтроку(
		Пользователь, ПараметрПериодНачало, ПараметрПериодОкончание);
КонецПроцедуры

// Идемпотентный фолбэк показа/скрытия оверлея "Все бейджи" через DOM поля HTML.
// Основной механизм - JS прямо в странице (делегированный клик по data-act),
// т.к. движок HTML-поля не всегда отражает запись в DOM из BSL; здесь ставим
// тот же класс, что и JS, поэтому конфликта при двойном срабатывании нет.
// Если DOM поля недоступен - тихо игнорируем.
&НаКлиенте
Процедура ПереключитьОверлейБейджей(Элемент, Знач Показать)
	
	Попытка
		
		Оверлей = Элемент.Документ.getElementById("badges-overlay");
		
		Если Оверлей <> Неопределено Тогда
			
			Оверлей.className = ?(Показать, "overlay open", "overlay");
		КонецЕсли;
	Исключение
		// DOM поля недоступен в текущем режиме - пропускаем.
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТемаПоИД(Знач ИД)
	
	Возврат Справочники.Темы.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
	
КонецФункции

&НаСервереБезКонтекста
Функция МатериалПоИД(Знач ИД)
	
	Возврат Справочники.МатериалыБиблиотеки.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
	
КонецФункции

// Открывает материал: если у него есть предрендеренные страницы книги - открывает
// встроенный просмотрщик (обработка ПросмотрКниги, страницы PNG в поле HTML);
// иначе показывает карточку справочника.
&НаКлиенте
Процедура ОткрытьМатериал(Знач ИД)

	Если ЕстьКнигаУМатериала(ИД) Тогда
		ОткрытьФорму("Обработка.ПросмотрКниги.Форма.Форма", Новый Структура("МатериалИД", ИД), ЭтотОбъект);
	Иначе
		ПоказатьЗначение(, МатериалПоИД(ИД));
	КонецЕсли;

КонецПроцедуры

// Возвращает Истина, если у материала есть предрендеренные страницы книги.
&НаСервереБезКонтекста
Функция ЕстьКнигаУМатериала(Знач ИД)

	Материал = Справочники.МатериалыБиблиотеки.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
	Хранилище = Материал.СтраницыКниги;
	Если Хранилище = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Страницы = Хранилище.Получить();
	Возврат ТипЗнч(Страницы) = Тип("Массив") И Страницы.Количество() > 0;

КонецФункции

#КонецОбласти
